---
kind: property
id: P:Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.ExternalParameterService
source: html/97afe6a1-147c-bc00-5ec8-a86f76230658.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.ExternalParameterService Property

Autodesk Internal: The service for shared parameter selection.

## Syntax (C#)
```csharp
public static ExternalServiceId ExternalParameterService { get; }
```